Repository: FKdevelopers254/celebrating-services
Catalog: celebrating_ui-main_frontend/celebrating_ui-main/lib/l10n/app_*.arb
Languages: sw

# drawerHeader
source: Menu
sw: Menyu

# item1
source: Home
sw: Nyumbani

# item2
source: Profile
sw: Wasifu

source: Feed
sw: Mlisho

source: Popular
sw: Maarufu

source: Trending
sw: Inapendwa

source: Thank you for signing up!
sw: Asante kwa kujisajili!

# thankYouForRegistering
source: Thank you for registering. Please complete your profile to continue.
sw: Asante kwa kujisajili. Tafadhali kamilisha wasifu wako ili kuendelea.

source: Enter Verification Code
sw: Weka Nambari ya Uthibitisho

# codeSentTo
source: A code has been sent to {email}
sw: Nambari imetumwa kwa {email}

source: Verify
sw: Thibitisha

# didNotReceiveEmail
source: Didn't receive the email?
sw: Hujapokea barua pepe?

source: Resend OTP
sw: Tuma tena OTP

source: Choose Account Type
sw: Chagua Aina ya Akaunti

source: Member
sw: Mwanachama

# memberDescription
source: Access community features and connect with others.
sw: Pata huduma za jamii na uunganishwe na wengine.

source: Celebrity Status
sw: Hali ya Umaarufu

# celebrityDescription
source: Get verified and unlock exclusive features.
sw: Thibitishwa na upate huduma za kipekee.

source: Continue as Member
sw: Endelea kama Mwanachama

source: Continue as
sw: Endelea kama

source: Celebrity
sw: Mtu Maarufu

# continueText
source: Continue
sw: Endelea

# appTitle
source: Celebrating
sw: Kusherehekea

source: Toggle Theme
sw: Badilisha mandhari

source: Toggle Language
sw: Badilisha lugha

source: Hello!
sw: Hujambo!

source: Email or Username
sw: Barua pepe au jina la mtumiaji

source: Username required
sw: Jina la mtumiaji linahitajika

source: Password required
sw: Nenosiri linahitajika

source: Sign In
sw: Ingia

source: Register
sw: Jisajili

source: Sign Up
sw: Jisajili

source: Full Name
sw: Jina kamili

source: Full name required
sw: Jina kamili linahitajika

source: Email
sw: Barua pepe

# enterValidEmail
source: Enter a valid email
sw: Weka barua pepe halali

source: Username
sw: Jina la mtumiaji

source: Password
sw: Nenosiri

# passwordMinLength
source: Password must be at least 6 characters
sw: Nenosiri lazima liwe na angalau herufi 6

source: Confirm Password
sw: Thibitisha nenosiri

# confirmPasswordRequired
source: Confirm password
sw: Thibitisha nenosiri

source: Role
sw: Nafasi

source: Role required
sw: Nafasi inahitajika

# signUpForAccount
source: Sign Up for an Account
sw: Jisajili kwa akaunti

# alreadyHaveAccount
source: Already have an account?
sw: Tayari una akaunti?

source: Celebrating
sw: Kusherehekea

source: Passwords do not match
sw: Nenosiri halilingani

source: Complete Your Profile
sw: Kamilisha wasifu wako

source: First name
sw: Jina la kwanza

source: First name required
sw: Jina la kwanza linahitajika

source: Last name
sw: Jina la mwisho

source: Last name required
sw: Jina la mwisho linahitajika

source: Select Sex
sw: Chagua jinsia

# pleaseSelectSex
source: Please select your sex
sw: Tafadhali chagua jinsia yako

source: Birth Date
sw: Tarehe ya kuzaliwa

source: Month
sw: Mwezi

source: Day
sw: Siku

source: Year
sw: Mwaka

source: Req.
sw: Hit.

source: Phone number (optional)
sw: Nambari ya simu (hiari)

source: Select Country
sw: Chagua nchi

# pleaseSelectCountry
source: Please select a country
sw: Tafadhali chagua nchi

# selectState
source: Select State / Region
sw: Chagua jimbo/eneo

# pleaseSelectState
source: Please select a state
sw: Tafadhali chagua jimbo

source: Select City
sw: Chagua mji

# pleaseSelectCity
source: Please select a city
sw: Tafadhali chagua mji

# agreeNewsletter
source: I expressly agree to receive the newsletter
sw: Nakubali kupokea jarida

# agreeTerms
source: By creating your account you agree to our
sw: Kwa kuunda akaunti yako unakubali

source: Terms
sw: Masharti

source: Privacy Policy
sw: Sera ya faragha

source: Complete Onboarding
sw: Kamilisha usajili

source: Add Images
sw: Ongeza Picha

source: Add Video
sw: Ongeza Video

source: Post
sw: Tuma

source: Stream Tab
sw: Kipengele cha Mwangaza

source: Audio Tab
sw: Kipengele cha Sauti

source: Celebrate
sw: Sherehekea

source: Stream
sw: Mwangaza

source: Audio
sw: Sauti

# celebrateYou
source: Let Us Celebrate You
sw: Tusherehekee Wewe

# welcomeAudienceAwaits
source: Welcome Your Audience Awaits.
sw: Karibu, Watazamaji Wanasubiri.

source: Add Family
sw: Ongeza Familia

# searchAndAddFamily
source: Search and add your family members.
sw: Tafuta na ongeza wanafamilia.

source: Search by name or username
sw: Tafuta kwa jina au jina la mtumiaji

source: Not found
sw: Haijapatikana

source: Invite
sw: Alika

# inviteSent
source: Invite sent to "{name}"
sw: Mwaliko umetumwa kwa "{name}"

# postsTab
source: Posts
sw: Machapisho

# careerTab
source: Career
sw: Kazi

# wealthTab
source: Wealth
sw: Utajiri

# personalTab
source: Personal
sw: Binafsi

# publicPersonaTab
source: Public Persona
sw: Mtu wa Umma

source: Net Worth
sw: Utajiri Jumla

source: Family
sw: Familia

source: Relationships
sw: Mahusiano

source: Education
sw: Elimu

source: Hobbies
sw: Shughuli za ziada

source: Lifestyle
sw: Mtindo wa Maisha

source: Diet
sw: Lishe

source: Spirituality
sw: Kiroho

source: Involved Causes
sw: Sababu Anazoshiriki

source: Public Image
sw: Taswira ya Umma

source: Controversies
sw: Mijadala

source: Fashion Style
sw: Mtindo wa Mavazi

source: Follow
sw: Fuata

source: Followers
sw: Wafuasi

source: Posts
sw: Machapisho

source: Events
sw: Matukio

source: Pets
sw: Wanyama wa kufugwa

source: Tattoos
sw: Tatoo

source: Favourites
sw: Vipendwa

source: Talents
sw: Vipaji

source: View Profile
sw: ANGALIA WASIFU

source: Fan Theories & Interactions
sw: NADHARIA ZA MASHABIKI & MINGILIANO

source: Socials
sw: Mitandao ya Kijamii

source: Search
sw: Tafuta

# searchHint
source: Search...
sw: Tafuta...

# tabPeople
source: People
sw: Watu

# tabPlaces
source: Places
sw: Maeneo

# tabAudio
source: Audio
sw: Sauti

# tabCategories
source: Categories
sw: Makundi

# tabRooms
source: Rooms
sw: Vyumba

# tabStream
source: Stream
sw: Mwangaza

source: Nothing to display
sw: Hakuna cha kuonyesha

source: Categories Tab
sw: Kipengele cha Makundi

source: Room Tab
sw: Kipengele cha Chumba

# noLiveStreams
source: No live streams available
sw: Hakuna matangazo ya moja kwa moja

source: Identity Verification
sw: Uthibitisho wa Utambulisho

# identityVerificationDesc
source: Please take a clear photo of your government-issued ID or passport. This is required to verify your celebrity status.
sw: Tafadhali piga picha wazi ya kitambulisho chako au pasipoti. Hii inahitajika kuthibitisha hadhi yako ya umaarufu.

# takeFrontPhotoInstruction
source: Take a clear photo of the FRONT of your ID
sw: Piga picha wazi ya UPANDE WA MBELE wa kitambulisho chako

# takeBackPhotoInstruction
source: Take a clear photo of the BACK of your ID
sw: Piga picha wazi ya UPANDE WA NYUMA wa kitambulisho chako

source: Take Front Photo
sw: Piga Picha ya Mbele

source: Take Back Photo
sw: Piga Picha ya Nyuma

source: Retake Photo
sw: Piga Tena Picha

source: Front of ID:
sw: Mbele ya Kitambulisho:

source: Back of ID:
sw: Nyuma ya Kitambulisho:

source: Submit for Verification
sw: Tuma kwa Uthibitisho

source: Verification submitted!
sw: Uthibitisho umetumwa!

source: Join The Community (Sign Up)
sw: Jiunge na Jamii (Ingia)

source: Join The Community (Sign In)
sw: Jiunge na Jamii (Jisajili)

source: Add Manually
sw: Ongeza Mwenyewe

# addedFamilyMember
source: Added family member: {name}
sw: Umeongeza mwanafamilia: {name}

source: Skip
sw: Ruka

source: Add Wealth
sw: Ongeza Utajiri

# addWealthInfo
source: Add your wealth information.
sw: Ongeza taarifa zako za utajiri.

# addedWealthItem
source: Added wealth item: {name}
sw: Umeongeza kipengele cha utajiri: {name}

source: Add Degree
sw: Ongeza Shahada

# pleaseFillAllFieldsToAddDegree
source: Please fill all fields to add a degree.
sw: Tafadhali jaza sehemu zote kuongeza shahada.

source: Finish
sw: Maliza

source: Add
sw: Ongeza

# degreeLabel
source: Degree (e.g. BSc, MSc, PhD, Masters)
sw: Shahada (km. BSc, MSc, PhD, Masters)

source: Enter degree
sw: Weka shahada

source: Certifying University
sw: Chuo Kikuu Kinachothibitisha

source: Enter university
sw: Weka chuo kikuu

source: Year of Completion
sw: Mwaka wa Kumaliza

source: Enter year
sw: Weka mwaka

source: Added Degrees:
sw: Shahada Zilizoongezwa:

source: Add Family Member
sw: Ongeza Mwanafamilia

source: Open Camera
sw: Kamera

source: Open Gallery
sw: Maktaba

source: Enter full name
sw: Weka jina kamili

source: Age
sw: Umri

source: Enter age
sw: Weka umri

# enterValidAge
source: Enter a valid age
sw: Weka umri halali

# socialUsername
source: {platform} Username
sw: Jina la mtumiaji wa {platform}

source: Add Member
sw: Ongeza Mwanachama

source: Add Wealth Item
sw: Ongeza Kipengele cha Utajiri

source: Category
sw: Aina

# categoryValueCar
source: Car
sw: Gari

# categoryValueHouse
source: House
sw: Nyumba

# categoryValueArt
source: Art
sw: Sanaa

# categoryValueProperty
source: Property
sw: Mali

# categoryValueJewelry
source: Jewelry
sw: Vito

# categoryValueStocks
source: Stocks
sw: Hisa

# categoryValueBusiness
source: Business
sw: Biashara

# categoryValueOther
source: Other
sw: Nyingine

# selectCategory
source: Select a category
sw: Chagua aina

source: Name
sw: Jina

source: Enter name
sw: Weka jina

source: Description
sw: Maelezo

source: Enter description
sw: Weka maelezo

source: Estimated Value (optional)
sw: Thamani Inayokadiriwa (hiari)

source: Add Education
sw: Ongeza Elimu

# addEducationInfo
source: Add Education Information
sw: Ongeza Taarifa za Elimu

source: Home
sw: Nyumbani

source: Profile
sw: Wasifu

source: Cars
sw: Magari

source: Houses
sw: Nyumba

source: Art Collection
sw: Mkusanyiko wa Sanaa

source: Watch Collection
sw: Mkusanyiko wa Saa

source: Sign
sw: Alama

source: ... more
sw: ... zaidi

source: show less
sw: onyesha kidogo

source: You rated
sw: Umeweka kiwango

source: stars
sw: nyota

# youRatedStars
source: You rated {count} stars!
sw: Umeweka kiwango cha nyota {count}!

# liveTab
source: Live
sw: Moja kwa moja

# recordedTab
source: Recorded
sw: Iliyorekodiwa

# captionHint
source: What is on your mind?
sw: Unafikiria nini?

# searchCategoryHint
source: Search Category...
sw: Tafuta Kategoria...
